'''
Задание 4.7
Преобразовать MAC-адрес mac в двоичную строку такого вида: 101010101010101010111011101110111100110011001100
'''


mac = 'AAAA:BBBB:CCCC'
a=''.join(mac.split(':'))
b = bin(int(a,16))
print(b[2:])