'''
Задание 5.2
Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000
Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

input = input("Введите ip адресс и префикс: ")
print(input)

prefix = input[:-3].split('.')
A = int(prefix[0])
B = int(prefix[1])
C = int(prefix[2])
D = int(prefix[3])
print("""
Network:
{0:<8} {1:<8} {2:<8} {3:<8}
{0:08b} {1:08b} {2:08b} {3:08b}
""".format(A,B,C,D))


mask = input[-3:]
submask = {
    '/20':'255.255.240.0',
    '/21':'255.255.248.0',
    '/22':'255.255.252.0',
    '/23':'255.255.254.0',
    '/24':'255.255.255.0',
    '/25':'255.255.255.128',
    '/26':'255.255.255.192',
    '/27':'255.255.255.224',
    '/28':'255.255.255.240',
    '/29':'255.255.255.248',
    '/30':'255.255.255.252',
}

temp = submask[mask]
mask1 = temp.split('.')
print("""
Mask:
"""+mask+"""    
{0:<8} {1:<8} {2:<8} {3:<8}
{0:08b} {1:08b} {2:08b} {3:08b}
""".format(int(mask1[0]),int(mask1[1]),int(mask1[2]),int(mask1[3])))